Repository: Sporidis/frituur-ordering-system
Catalog: frontend/lib/l10n/app_*.arb
Languages: nl

# appTitle
source: Frituur Ordering System
nl: Frituur Bestelsysteem

source: Cart
nl: Winkelwagen

source: Order
nl: Bestelling

source: Fries
nl: Frietjes

source: Price
nl: Prijs

source: Add to Cart
nl: Toevoegen aan Winkelwagen

source: Language
nl: Taal

source: English
nl: Engels

source: Dutch
nl: Nederlands

# welcome
source: Welcome to our Frituur!
nl: Welkom bij onze Frituur!

source: Select Language
nl: Selecteer Taal

source: Total
nl: Totaal

source: Checkout
nl: Afrekenen

source: Drinks
nl: Drankjes

source: added to cart
nl: toegevoegd aan winkelwagen

source: Connected to Backend
nl: Verbonden met Backend

source: Disconnected
nl: Verbroken

source: WebSocket Controls
nl: WebSocket Bediening

source: Connect
nl: Verbinden

source: Disconnect
nl: Verbreken

source: Order Management
nl: Bestelling Beheer

source: Customer Name
nl: Klantnaam

source: Create Sample Order
nl: Maak Voorbeeldbestelling

source: Create Multiple Sample Orders
nl: Maak Meerdere Voorbeeldbestellingen

source: Select Order to Track:
nl: Selecteer Bestelling om te Volgen:

source: Choose an order
nl: Kies een bestelling

source: Join Order Room
nl: Ga naar Bestelling Kamer

source: Leave Order Room
nl: Verlaat Bestelling Kamer

# noStatusUpdatesYet
source: No status updates yet. Create an order and join its room to see real-time updates.
nl: Nog geen status updates. Maak een bestelling en ga naar de kamer om real-time updates te zien.

# orderLabel
source: Order:
nl: Bestelling:

# messageLabel
source: Message:
nl: Bericht:

# timeLabel
source: Time:
nl: Tijd:

source: Kitchen Simulation
nl: Keuken Simulatie

source: Simulate Kitchen Workflow
nl: Simuleer Keuken Workflow

# orderCreated
source: Order created: {orderId}
nl: Bestelling gemaakt: {orderId}

# createdSampleOrders
source: Created {count} sample orders
nl: {count} voorbeeldbestellingen gemaakt

source: Kitchen workflow started
nl: Keuken workflow gestart

source: Failed to start kitchen workflow
nl: Kon keuken workflow niet starten

# errorCreatingOrder
source: Error creating order: {error}
nl: Fout bij maken bestelling: {error}

# errorCreatingSampleOrders
source: Error creating sample orders: {error}
nl: Fout bij maken voorbeeldbestellingen: {error}

# errorGeneric
source: Error: {error}
nl: Fout: {error}

# orderStatusUpdate
source: Order {orderId}: {status}
nl: Bestelling {orderId}: {status}

# statusPending
source: Pending
nl: In behandeling

# statusInProgress
source: In Progress
nl: In voorbereiding

# statusReady
source: Ready
nl: Klaar

# statusCompleted
source: Completed
nl: Voltooid

# kitchenStartedPreparing
source: Kitchen started preparing your order
nl: Keuken is begonnen met het bereiden van uw bestelling

# orderReadyForPickup
source: Your order is ready for pickup!
nl: Uw bestelling is klaar voor ophalen!

# statusChangedToPending
source: Order status changed to pending
nl: Bestelling status gewijzigd naar in behandeling

# statusChangedToInProgress
source: Order status changed to in progress
nl: Bestelling status gewijzigd naar in voorbereiding

# statusChangedToReady
source: Order status changed to ready
nl: Bestelling status gewijzigd naar klaar

# statusChangedToCompleted
source: Order status changed to completed
nl: Bestelling status gewijzigd naar voltooid

source: Payment PoC
nl: Betaling PoC

source: Payment Details
nl: Betalingsgegevens

source: Amount (€)
nl: Bedrag (€)

# pleaseEnterAmount
source: Please enter an amount
nl: Voer een bedrag in

# pleaseEnterValidAmount
source: Please enter a valid amount
nl: Voer een geldig bedrag in

source: Please enter customer name
nl: Voer klantnaam in

source: Order ID
nl: Bestelling ID

source: Please enter order ID
nl: Voer bestelling ID in

source: Creating...
nl: Aanmaken...

source: Create Payment Intent
nl: Maak Betalingsintentie

# createDemoPayment
source: Create Demo Payment (€19.99)
nl: Maak Demo Betaling (€19.99)

source: Payment Intent Created
nl: Betalingsintentie Aangemaakt

# amountLabel
source: Amount:
nl: Bedrag:

source: Currency:
nl: Valuta:

source: Processing...
nl: Verwerken...

source: Process Payment
nl: Verwerk Betaling

source: Payment Result
nl: Betalingsresultaat

source: Test Card Numbers
nl: Test Kaartnummers

# useTestCardNumbers
source: Use these test card numbers for testing:
nl: Gebruik deze test kaartnummers voor testen:

# declinedTestCard
source: • Declined: 4000000000000002
nl: • Geweigerd: 4000000000000002

# testCardInstructions
source: • Any future date, any CVC
nl: • Elke toekomstige datum, elke CVC

# failedToInitializeStripe
source: Failed to initialize Stripe: {error}
nl: Kon Stripe niet initialiseren: {error}

# paymentIntentCreatedSuccess
source: Payment intent created: {id}
nl: Betalingsintentie aangemaakt: {id}

source: Failed to create payment intent
nl: Kon betalingsintentie niet aanmaken

source: Payment successful! 🎉
nl: Betaling succesvol! 🎉

# paymentFailed
source: Payment failed: {error}
nl: Betaling mislukt: {error}

# errorProcessingPayment
source: Error processing payment: {error}
nl: Fout bij verwerken betaling: {error}

# demoPaymentIntentCreated
source: Demo payment intent created: {id}
nl: Demo betalingsintentie aangemaakt: {id}

source: Failed to create demo payment
nl: Kon demo betaling niet aanmaken

source: Customer
nl: Klant

# selectPocToTest
source: Select a PoC to test different features of the Frituur Ordering System
nl: Selecteer een PoC om verschillende functies van het Frituur Bestelsysteem te testen

# poc1I18nDescription
source: Internationalization (Dutch/English)
nl: Internationalisatie (Nederlands/Engels)

# i18nIntegratedInAllPocs
source: i18n is integrated in all PoCs
nl: i18n is geïntegreerd in alle PoC's

# poc2WebsocketDescription
source: Real-time Order Updates & Kitchen Simulation
nl: Real-time Bestelling Updates & Keuken Simulatie

# poc3StripeDescription
source: Payment Processing & Card Payments
nl: Betalingsverwerking & Kaart Betalingen

source: PoC 4: Modular
nl: PoC 4: Modulair

# poc4ModularDescription
source: Clean Architecture & Module Boundaries
nl: Schone Architectuur & Module Grenzen

source: COMING SOON
nl: BINNENKORT

# comingSoonModularPoc
source: Coming Soon: Modular Monolith PoC
nl: Binnenkort: Modulaire Monolith PoC

source: PoC Testing
nl: PoC Testen

source: Stats
nl: Statistieken

source: Stability Test
nl: Stabiliteitstest

# testingEllipsis
source: Testing...
nl: Testen...

source: Last Pong
nl: Laatste Pong

# connectionStatsTitle
source: Connection Stats
nl: Verbindingsstatistieken

source: 🏓 Ping sent to server
nl: 🏓 Ping naar server verzonden

source: 📊 Requesting connection statistics...
nl: 📊 Verbindingsstatistieken opvragen...

# startingStabilityTest
source: 🧪 Starting 30-second stability test...
nl: 🧪 30-seconden stabiliteitstest starten...

source: ✅ Stability test completed
nl: ✅ Stabiliteitstest voltooid

source: ❌ Connection lost during stability test
nl: ❌ Verbinding verbroken tijdens stabiliteitstest

# currentLanguage
source: Current Language: {language}
nl: Huidige taal: {language}

# statsActive
source: Active:
nl: Actief:

# statsTotal
source: Total:
nl: Totaal:

source: Refund
nl: Terugbetaling

# optionalRefundAmountHint
source: Optional: specify refund amount (defaults to full)
nl: Optioneel: specificeer terugbetalingsbedrag (standaard volledig)

source: Refund successful
nl: Terugbetaling succesvol

source: Refund failed
nl: Terugbetaling mislukt
